/**
 * ExchangeNum
 */
public class ExchangeNum {

    public static void main(String[] args) {
        int a=2,b=3;
        a = a ^ b;
        b = a ^ b;
        a = a ^ b;
        System.out.printf("a = %d b= %d", a,b);
        //这样就达成了将a的值赋给b 
        //b的值赋给a的效果
        //过程分析
        //00000000 00000000 00000000 00000010 这是a 值为2
        //00000000 00000000 00000000 00000011 这是b 值为3
        //a、b进行异或操作并赋值给a
        //00000000 00000000 00000000 00000001 这是异或操作后的a
        //将它与b异或 结果赋值给b
        //00000000 00000000 00000000 00000010 这是赋值后b的值为2
        //再将两者进行异或
        //00000000 00000000 00000000 00000011 这是最终a的值为3
        //我们发现a和b的值已经交换了

    }
}